import re

text = ("#N1131. 15.07.2024 14:00\n"
        "#КунгЛао - #ДжэкиБриггс\n"
        "#КунгЛао_ДжэкиБриггс\n"
        "П1/П2 - 1.995/1.904\n"
        "F 3.175/B 9.08/R 1.5\n"
        "F_Yes 3.175/F_No 1.375\n"
        "18.5/23.5/34.5\n\n"
        "1. П1-F-36 ТМM\n"
        "2. П1-B-37 ТБ\n"
        "3. П2-R-46 ТББ\n"
        "4. П1-B-45 ТББ\n"
        "5. П2-R-24 ТММ\n"
        "Ставим тут https://h5lwvwj.top/13xD\n"
        "Бонус до 25000 руб., промокод STATAMK")

black_list = ["ЭрронБлэк", "ТакедаТакахаши", "ДжейсонВурхиз", "Кенши", "Шиннок", "ФерраИТорр", "Горо", "Чужой", "Джакс", "КунгДжин",
              "Кано", "ЛюКенг", "Рептилия", "Хищник", "СабЗиро"]

date = re.search("([0-9]+(\.[0-9]+)+) [0-9]+:[0-9]+", text).group(0)
heroes1 = re.search("#[A-Za-zА-Яа-я]+_[A-Za-zА-Яа-я]+", text).group(0).split("_")[0].replace("#", "")
heroes2 = re.search("#[A-Za-zА-Яа-я]+_[A-Za-zА-Яа-я]+", text).group(0).split("_")[1]
time = re.search("([0-9]*\.[0-9]+(/[0-9]*\.[0-9]+(/[0-9]*\.[0-9]+))+)", text).group(0).split("/")
result = re.findall("[0-9]\. П[0-9]-[A-Za-z]-[0-9]+ [A-Za-zА-Яа-я]+", text).split()

a = float(time[1]) - float(time[0])
b = float(time[2]) - float(time[1])

print(result)